<!DOCTYPE html>
<html lang="en">
{{-- //* shift + alt + f == จัดหน้าฟอร์ม**// --}}

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <link rel="stylesheet" href="Entreprenur.css">
    <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.3.1/dist/css/bootstrap.min.css" rel="stylesheet"
        integrity="sha384-4bw+/aepP/YC94hEpVNVgiZdgIC5+VKNBQNGCHeKRQN+PtmoHDEXuppvnDJzQIu9" crossorigin="anonymous">
    <script src="https://cdn.ckeditor.com/4.16.1/standard/ckeditor.js"></script>
    <script src="https://cdn.jsdelivr.net/npm/bootstrap@5.3.1/dist/js/bootstrap.bundle.min.js"
        integrity="sha384-HwwvtgBNo3bZJJLYd8oVXjrBZt8cqVSpeBNS5n7C8IVInixGAoxmnlMuBnhbgrkm" crossorigin="anonymous">
    </script>
    <title>Entrepreneur</title>
</head>

<body style="  background-color: #30cfd0;">
    <section class="navbar">
        <div class="logo">
            <h1>MyLogo</h1>
        </div>
        <ul>
            <li><a href="{{ url('entre_dashboard2' )}}">หน้าหลัก</a></li>
            <li><a href="#">ประกาศงาน</a></li>
            <li><a href="#">ผู้สมัครงาน</a></li>
            <li><a href="#">กาตั้งค่า Account</a></li>
            <li><a href="#">ออกระบบ</a></li>
        </ul>
    </section>
    <div class="head-form">
    <form class="form-head" action="{{ route('entre.store') }}" method="POST" enctype="multipart/form-data">
        @if (Session::has('success'))
            <div class="alert alert-success">{{ Session::get('success') }}</div>
        @endif
        @if (Session::has('fail'))
            <div class="alert alert-danger">{{ Session::get('fail') }}</div>
        @endif
        @csrf
        <section class="form-body">
            <form class="form-head">
                <div class="form-head-1">
                    <div class="form-group-1">
                        <div class="form-body">


                            <div class="form-head-1">
                                <div class="form-group-1">
                                    <div class="form-group">
                                        <h1>ประกาศงาน</h1>

                                        <label for="jobPosition">ใส่ ID</label>
                                        <input type="text" name="entre_id" class="form-control"
                                            placeholder="กรอกตำแหน่งงาน">
                                        <span class="text-danger">
                                            @error('jobPosition')
                                                {{ $message }}
                                            @enderror
                                        </span>

                                        <label for="jobPosition">ตำแหน่งงาน</label>
                                        <input type="text" name="jobPosition" class="form-control"
                                            placeholder="กรอกตำแหน่งงาน">
                                        <span class="text-danger">
                                            @error('jobPosition')
                                                {{ $message }}
                                            @enderror
                                        </span>

                                    </div>
                                    <div class="form-group">
                                        <label for="jobPositionThai">ตำแหน่งงาน (ภาษาไทย)</label>
                                        <input type="text" name="jobPositionThai" class="form-control"
                                            placeholder="กรอกตำแหน่งงาน (ภาษาไทย)">
                                        <span class="text-danger">
                                            @error('jobPositionThai')
                                                {{ $message }}
                                            @enderror
                                        </span>
                                    </div>
                                    <br>

                                    <label for="subject">ประเภทธุรกิจ:</label>
                                    <select name="subject" id="subject">
                                        <option value="" selected="selected">---เลือกประเภทธุรกิจ---</option>
                                        <!-- เพิ่มตัวเลือกประเภทงานที่มาจาก JavaScript ตรงนี้ -->
                                    </select>
                                    <br><br>

                                    <label for="topic">ประเภทงาน:</label>
                                    <select name="topic" id="topic">
                                        <option value="" selected="selected">---เลือกประเภทงาน---</option>
                                        <!-- เพิ่มตัวเลือกประเภทธุรกิจที่มาจาก JavaScript ตรงนี้ -->
                                    </select>
                                    <br><br>

                                    <label for="chapter">สถานที่ทำงานหลัก:</label>
                                    <select name="chapter" id="chapter">
                                        <option value="" selected="selected">---เลือกสถานที่ทำงานหลัก---</option>
                                        <!-- เพิ่มตัวเลือกสถานที่ทำงานหลักที่มาจาก JavaScript ตรงนี้ -->
                                    </select>
                                    <br><br>

                                    <h3>ระยะเวลาจ้างงาน</h3>
                                
                                    <label for="check_type">ระยะเวลาจ้างงาน:</label>
                                    <select name="check_type" id="check_type">
                                        <option value= "">--ประเภทการจ้างงาน--</option>
                                        <option value="งานเต็มเวลา">งานเต็มเวลา</option>
                                        <option value="งานนอกเวลา">งานนอกเวลา</option>
                                        <option value="งานประจำ">งานประจำ</option>
                                        <option value="งานชั่วคราว">งานชั่วคราว</option>
                                        <option value="งานสัญญาจ้าง">งานสัญญาจ้าง</option>
                                        <option value="นักศึกษาฝึกหัด">นักศึกษาฝึกหัด</option>
                                        <option value="งานอิสระ">งานอิสระ</option>
                                        <!-- เพิ่มตัวเลือกเพิ่มเติมที่ถูกต้องตามคุณสมบัติของคุณ -->
                                    </select>


                                    <div class="form-group">
                                        <br>
                                        <label for="jobDescription">รายละเอียดงาน</label>
                                        <textarea name="jobDescription" id="description" maxlength="5000" style="width: 100%; height: 200px;"></textarea>
                                    </div>

                                    <div id="charCounter">0/5000 characters</div>
                                    <br>

                                    <button type="submit" class="btn btn-block btn-success">
                                        บันทึก
                                    </button>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
            </form>
            </div>
            </div>
            </div>
            </div>
            </div>
            </div>
            </div>
            </div>
    </form>
</div>
    </section>
    <script>
        CKEDITOR.replace('description');
        CKEDITOR.instances.description.on('change', function() {
            const length = this.getData().replace(/<[^>]*>/g, '').length;
            const counter = document.querySelector('#charCounter');
            counter.textContent = `${length}/5000 characters`;
        });

        var subjectSel = document.getElementById("subject");
        var topicSel = document.getElementById("topic");
        var chapterSel = document.getElementById("chapter");

        var subjectObject = {
            "ธุรกิจการตลาดและโฆษณา": ["การตลาดและโฆษณาออนไลน์", "บริหารสื่อสาร", "การวิจัยตลาด", "การพัฒนาแบรนด์",
                "การตลาดทางสังคม", "การขายและการสื่อสาร",
                "การจัดกิจกรรมโฆษณา"
            ],
            "ธุรกิจการเงินและบัญชี": ["บัญชีและการเงิน", "การวิเคราะห์การเงิน", "การเงินลงทุน", "บริหารความเสี่ยง",
                "บริหารเงินสด",
                "การธนาคารและการเงิน"
            ],
            "ธุรกิจการบริหารและการจัดการ": ["การบริหารทั่วไป", "การบริหารโรงงาน", "การบริหารโครงการ",
                "การบริหารทรัพยากรมนุษย์", "การบริหารธุรกิจ",
                "บริหารโฆษณา"
            ],
            "ธุรกิจการศึกษาและการสอน": ["การสอนและการศึกษา", "การสอนออนไลน์", "การศึกษาสู่อาชีพ", "การพัฒนาหลักสูตร",
                "การสอนศิลปะและกีฬา"
            ],
            "ธุรกิจการรักษาสุขภาพ": ["การแพทย์และการรักษา", "การพยาบาล", "การจิตวิทยาและสุขภาพจิต", "การกายภาพบำบัด",
                "การพาณิชย์และสุขภาพ"
            ],
            "ธุรกิจบริการลูกค้าและโรงแรม": ["บริการลูกค้า", "การโรงแรม", "บริการสนามบิน", "บริการโรงรถเช่า",
                "บริการโรงรถไฟ",
                "บริการโรงรถบัส"
            ],
            "ธุรกิจศิลปะและสื่อสารมวลชน": ["ศิลปะและการแสดง", "สื่อสารมวลชน", "การพิมพ์และสื่อสาร",
                "การสร้างสื่อสารมวลชน", "การออกแบบและสื่อสาร"
            ],
            "ธุรกิจการผลิตและเทคนิค": ["การผลิต", "เทคนิคและช่าง", "การก่อสร้าง", "การเชิงชีววิภาค", "การยนต์"],
            "ธุรกิจการพาณิชย์และการค้า": ["การประกอบการ", "การค้าส่งออก", "การค้าปลีก", "การค้าส่งออก-นำเข้า",
                "การจัดการโฆษณา"
            ],
            "ธุรกิจเทคโนโลยีและสารสนเทศ": ["การพัฒนาซอฟต์แวร์", "การออกแบบเว็บ", "การเขียนโปรแกรม",
                "ผู้ดูแลระบบคอมพิวเตอร์", "นักวิเคราะห์ข้อมูล",
                "นักวิเคราะห์ระบบ"
            ]
        }
        var WorkObject = {
            "ธุรกิจการตลาดและโฆษณา": [
                "กรุงเทพ", "กระบี่", "กาญจนบุรี", "กาฬสินธุ์", "กำแพงเพชร", "ขอนแก่น",
                "จันทบุรี", "ฉะเชิงเทรา", "ชลบุรี", "ชัยนาท", "ชัยภูมิ", "ชุมพร", "เชียงราย",
                "เชียงใหม่", "ตรัง", "ตราด", "ตาก", "นครนายก", "นครปฐม", "นครพนม", "นครราชสีมา",
                "นครศรีธรรมราช", "นครสวรรค์", "นนทบุรี", "นราธิวาส", "น่าน", "บึงกาฬ", "บุรีรัมย์",
                "ปทุมธานี", "ประจวบคีรีขันธ์", "ปราจีนบุรี", "ปัตตานี", "พระนครศรีอยุธยา", "พะเยา",
                "พังงา", "พัทลุง", "พิจิตร", "พิษณุโลก", "เพชรบุรี", "เพชรบูรณ์", "แพร่", "ภูเก็ต",
                "มหาสารคาม", "มุกดาหาร", "แม่ฮ่องสอน", "ยโสธร", "ยะลา", "ร้อยเอ็ด", "ระนอง", "ระยอง",
                "ราชบุรี", "ลพบุรี", "ลำปาง", "ลำพูน", "เลย", "ศรีสะเกษ", "สกลนคร", "สงขลา", "สตูล",
                "สมุทรปราการ", "สมุทรสาคร", "สระแก้ว", "สระบุรี", "สิงห์บุรี", "สุโขทัย", "สุพรรณบุรี",
                "สุราษฎร์ธานี", "สุรินทร์", "หนองคาย", "หนองบัวลำภู", "อ่างทอง", "อำนาจเจริญ", "อุดรธานี",
                "อุตรดิตถ์", "อุทัยธานี", "อุบลราชธานี", "อ่างทอง", "อำนาจเจริญ"
            ],
            "ธุรกิจการเงินและบัญชี": ["กรุงเทพ", "กระบี่", "กาญจนบุรี", "กาฬสินธุ์", "กำแพงเพชร", "ขอนแก่น",
                "จันทบุรี", "ฉะเชิงเทรา", "ชลบุรี", "ชัยนาท", "ชัยภูมิ", "ชุมพร", "เชียงราย", "เชียงใหม่",
                "ตรัง", "ตราด", "ตาก", "นครนายก", "นครปฐม", "นครพนม", "นครราชสีมา", "นครศรีธรรมราช", "นครสวรรค์",
                "นนทบุรี", "นราธิวาส", "น่าน", "บึงกาฬ", "บุรีรัมย์", "ปทุมธานี", "ประจวบคีรีขันธ์",
                "ปราจีนบุรี", "ปัตตานี", "พระนครศรีอยุธยา", "พะเยา", "พังงา", "พัทลุง", "พิจิตร",
                "พิษณุโลก", "เพชรบุรี", "เพชรบูรณ์", "แพร่", "ภูเกต", "มหาสารคาม", "มุกดาหาร", "แม่ฮ่องสอน",
                "ยโสธร",
                "ยะลา", "ร้อยเอ็ด", "ระนอง", "ระยอง", "ราชบุรี", "ลพบุรี", "ลำปาง", "ลำพูน", "เลย", "ศรีสะเกษ",
                "สกลนคร", "สงขลา", "สตูล", "สมุทรปราการ", "สมุทรสาคร", "สระแก้ว", "สระบุรี", "สิงห์บุรี",
                "สุโขทัย", "สุพรรณบุรี", "สุราษฎร์ธานี", "สุรินทร์", "หนองคาย", "หนองบัวลำภู", "อ่างทอง",
                "อำนาจเจริญ", "อุดรธานี", "อุตรดิตถ์", "อุทัยธานี", "อุบลราชธานี", "อ่างทอง", "อำนาจเจริญ"
            ],
            "ธุรกิจการบริหารและการจัดการ": ["กรุงเทพ", "กระบี่", "กาญจนบุรี", "กาฬสินธุ์", "กำแพงเพชร", "ขอนแก่น",
                "จันทบุรี", "ฉะเชิงเทรา", "ชลบุรี", "ชัยนาท", "ชัยภูมิ", "ชุมพร", "เชียงราย", "เชียงใหม่",
                "ตรัง", "ตราด", "ตาก", "นครนายก", "นครปฐม", "นครพนม", "นครราชสีมา", "นครศรีธรรมราช", "นครสวรรค์",
                "นนทบุรี", "นราธิวาส", "น่าน", "บึงกาฬ", "บุรีรัมย์", "ปทุมธานี", "ประจวบคีรีขันธ์",
                "ปราจีนบุรี", "ปัตตานี", "พระนครศรีอยุธยา", "พะเยา", "พังงา", "พัทลุง", "พิจิตร",
                "พิษณุโลก", "เพชรบุรี", "เพชรบูรณ์", "แพร่", "ภูเกต", "มหาสารคาม", "มุกดาหาร", "แม่ฮ่องสอน",
                "ยโสธร",
                "ยะลา", "ร้อยเอ็ด", "ระนอง", "ระยอง", "ราชบุรี", "ลพบุรี", "ลำปาง", "ลำพูน", "เลย", "ศรีสะเกษ",
                "สกลนคร", "สงขลา", "สตูล", "สมุทรปราการ", "สมุทรสาคร", "สระแก้ว", "สระบุรี", "สิงห์บุรี",
                "สุโขทัย", "สุพรรณบุรี", "สุราษฎร์ธานี", "สุรินทร์", "หนองคาย", "หนองบัวลำภู", "อ่างทอง",
                "อำนาจเจริญ", "อุดรธานี", "อุตรดิตถ์", "อุทัยธานี", "อุบลราชธานี", "อ่างทอง", "อำนาจเจริญ"
            ],
            "ธุรกิจการศึกษาและการสอน": ["กรุงเทพ", "กระบี่", "กาญจนบุรี", "กาฬสินธุ์", "กำแพงเพชร", "ขอนแก่น",
                "จันทบุรี", "ฉะเชิงเทรา", "ชลบุรี", "ชัยนาท", "ชัยภูมิ", "ชุมพร", "เชียงราย", "เชียงใหม่",
                "ตรัง", "ตราด", "ตาก", "นครนายก", "นครปฐม", "นครพนม", "นครราชสีมา", "นครศรีธรรมราช", "นครสวรรค์",
                "นนทบุรี", "นราธิวาส", "น่าน", "บึงกาฬ", "บุรีรัมย์", "ปทุมธานี", "ประจวบคีรีขันธ์",
                "ปราจีนบุรี", "ปัตตานี", "พระนครศรีอยุธยา", "พะเยา", "พังงา", "พัทลุง", "พิจิตร",
                "พิษณุโลก", "เพชรบุรี", "เพชรบูรณ์", "แพร่", "ภูเกต", "มหาสารคาม", "มุกดาหาร", "แม่ฮ่องสอน",
                "ยโสธร",
                "ยะลา", "ร้อยเอ็ด", "ระนอง", "ระยอง", "ราชบุรี", "ลพบุรี", "ลำปาง", "ลำพูน", "เลย", "ศรีสะเกษ",
                "สกลนคร", "สงขลา", "สตูล", "สมุทรปราการ", "สมุทรสาคร", "สระแก้ว", "สระบุรี", "สิงห์บุรี",
                "สุโขทัย", "สุพรรณบุรี", "สุราษฎร์ธานี", "สุรินทร์", "หนองคาย", "หนองบัวลำภู", "อ่างทอง",
                "อำนาจเจริญ", "อุดรธานี", "อุตรดิตถ์", "อุทัยธานี", "อุบลราชธานี", "อ่างทอง", "อำนาจเจริญ"
            ],
            "ธุรกิจการรักษาสุขภาพ": ["กรุงเทพ", "กระบี่", "กาญจนบุรี", "กาฬสินธุ์", "กำแพงเพชร", "ขอนแก่น",
                "จันทบุรี", "ฉะเชิงเทรา", "ชลบุรี", "ชัยนาท", "ชัยภูมิ", "ชุมพร", "เชียงราย", "เชียงใหม่",
                "ตรัง", "ตราด", "ตาก", "นครนายก", "นครปฐม", "นครพนม", "นครราชสีมา", "นครศรีธรรมราช", "นครสวรรค์",
                "นนทบุรี", "นราธิวาส", "น่าน", "บึงกาฬ", "บุรีรัมย์", "ปทุมธานี", "ประจวบคีรีขันธ์",
                "ปราจีนบุรี", "ปัตตานี", "พระนครศรีอยุธยา", "พะเยา", "พังงา", "พัทลุง", "พิจิตร",
                "พิษณุโลก", "เพชรบุรี", "เพชรบูรณ์", "แพร่", "ภูเกต", "มหาสารคาม", "มุกดาหาร", "แม่ฮ่องสอน",
                "ยโสธร",
                "ยะลา", "ร้อยเอ็ด", "ระนอง", "ระยอง", "ราชบุรี", "ลพบุรี", "ลำปาง", "ลำพูน", "เลย", "ศรีสะเกษ",
                "สกลนคร", "สงขลา", "สตูล", "สมุทรปราการ", "สมุทรสาคร", "สระแก้ว", "สระบุรี", "สิงห์บุรี",
                "สุโขทัย", "สุพรรณบุรี", "สุราษฎร์ธานี", "สุรินทร์", "หนองคาย", "หนองบัวลำภู", "อ่างทอง",
                "อำนาจเจริญ", "อุดรธานี", "อุตรดิตถ์", "อุทัยธานี", "อุบลราชธานี", "อ่างทอง", "อำนาจเจริญ"
            ],
            "ธุรกิจบริการลูกค้าและโรงแรม": ["กรุงเทพ", "กระบี่", "กาญจนบุรี", "กาฬสินธุ์", "กำแพงเพชร", "ขอนแก่น",
                "จันทบุรี", "ฉะเชิงเทรา", "ชลบุรี", "ชัยนาท", "ชัยภูมิ", "ชุมพร", "เชียงราย", "เชียงใหม่",
                "ตรัง", "ตราด", "ตาก", "นครนายก", "นครปฐม", "นครพนม", "นครราชสีมา", "นครศรีธรรมราช", "นครสวรรค์",
                "นนทบุรี", "นราธิวาส", "น่าน", "บึงกาฬ", "บุรีรัมย์", "ปทุมธานี", "ประจวบคีรีขันธ์",
                "ปราจีนบุรี", "ปัตตานี", "พระนครศรีอยุธยา", "พะเยา", "พังงา", "พัทลุง", "พิจิตร",
                "พิษณุโลก", "เพชรบุรี", "เพชรบูรณ์", "แพร่", "ภูเกต", "มหาสารคาม", "มุกดาหาร", "แม่ฮ่องสอน",
                "ยโสธร",
                "ยะลา", "ร้อยเอ็ด", "ระนอง", "ระยอง", "ราชบุรี", "ลพบุรี", "ลำปาง", "ลำพูน", "เลย", "ศรีสะเกษ",
                "สกลนคร", "สงขลา", "สตูล", "สมุทรปราการ", "สมุทรสาคร", "สระแก้ว", "สระบุรี", "สิงห์บุรี",
                "สุโขทัย", "สุพรรณบุรี", "สุราษฎร์ธานี", "สุรินทร์", "หนองคาย", "หนองบัวลำภู", "อ่างทอง",
                "อำนาจเจริญ", "อุดรธานี", "อุตรดิตถ์", "อุทัยธานี", "อุบลราชธานี", "อ่างทอง", "อำนาจเจริญ"
            ],
            "ธุรกิจศิลปะและสื่อสารมวลชน": ["กรุงเทพ", "กระบี่", "กาญจนบุรี", "กาฬสินธุ์", "กำแพงเพชร", "ขอนแก่น",
                "จันทบุรี", "ฉะเชิงเทรา", "ชลบุรี", "ชัยนาท", "ชัยภูมิ", "ชุมพร", "เชียงราย", "เชียงใหม่",
                "ตรัง", "ตราด", "ตาก", "นครนายก", "นครปฐม", "นครพนม", "นครราชสีมา", "นครศรีธรรมราช", "นครสวรรค์",
                "นนทบุรี", "นราธิวาส", "น่าน", "บึงกาฬ", "บุรีรัมย์", "ปทุมธานี", "ประจวบคีรีขันธ์",
                "ปราจีนบุรี", "ปัตตานี", "พระนครศรีอยุธยา", "พะเยา", "พังงา", "พัทลุง", "พิจิตร",
                "พิษณุโลก", "เพชรบุรี", "เพชรบูรณ์", "แพร่", "ภูเกต", "มหาสารคาม", "มุกดาหาร", "แม่ฮ่องสอน",
                "ยโสธร",
                "ยะลา", "ร้อยเอ็ด", "ระนอง", "ระยอง", "ราชบุรี", "ลพบุรี", "ลำปาง", "ลำพูน", "เลย", "ศรีสะเกษ",
                "สกลนคร", "สงขลา", "สตูล", "สมุทรปราการ", "สมุทรสาคร", "สระแก้ว", "สระบุรี", "สิงห์บุรี",
                "สุโขทัย", "สุพรรณบุรี", "สุราษฎร์ธานี", "สุรินทร์", "หนองคาย", "หนองบัวลำภู", "อ่างทอง",
                "อำนาจเจริญ", "อุดรธานี", "อุตรดิตถ์", "อุทัยธานี", "อุบลราชธานี", "อ่างทอง", "อำนาจเจริญ"
            ],
            "ศิลปะและสื่อสารมวลชน": ["กรุงเทพ", "กระบี่", "กาญจนบุรี", "กาฬสินธุ์", "กำแพงเพชร", "ขอนแก่น",
                "จันทบุรี", "ฉะเชิงเทรา", "ชลบุรี", "ชัยนาท", "ชัยภูมิ", "ชุมพร", "เชียงราย", "เชียงใหม่",
                "ตรัง", "ตราด", "ตาก", "นครนายก", "นครปฐม", "นครพนม", "นครราชสีมา", "นครศรีธรรมราช", "นครสวรรค์",
                "นนทบุรี", "นราธิวาส", "น่าน", "บึงกาฬ", "บุรีรัมย์", "ปทุมธานี", "ประจวบคีรีขันธ์",
                "ปราจีนบุรี", "ปัตตานี", "พระนครศรีอยุธยา", "พะเยา", "พังงา", "พัทลุง", "พิจิตร",
                "พิษณุโลก", "เพชรบุรี", "เพชรบูรณ์", "แพร่", "ภูเกต", "มหาสารคาม", "มุกดาหาร", "แม่ฮ่องสอน",
                "ยโสธร",
                "ยะลา", "ร้อยเอ็ด", "ระนอง", "ระยอง", "ราชบุรี", "ลพบุรี", "ลำปาง", "ลำพูน", "เลย", "ศรีสะเกษ",
                "สกลนคร", "สงขลา", "สตูล", "สมุทรปราการ", "สมุทรสาคร", "สระแก้ว", "สระบุรี", "สิงห์บุรี",
                "สุโขทัย", "สุพรรณบุรี", "สุราษฎร์ธานี", "สุรินทร์", "หนองคาย", "หนองบัวลำภู", "อ่างทอง",
                "อำนาจเจริญ", "อุดรธานี", "อุตรดิตถ์", "อุทัยธานี", "อุบลราชธานี", "อ่างทอง", "อำนาจเจริญ"
            ],
            "ธุรกิจการผลิตและเทคนิค": ["กรุงเทพ", "กระบี่", "กาญจนบุรี", "กาฬสินธุ์", "กำแพงเพชร", "ขอนแก่น",
                "จันทบุรี", "ฉะเชิงเทรา", "ชลบุรี", "ชัยนาท", "ชัยภูมิ", "ชุมพร", "เชียงราย", "เชียงใหม่",
                "ตรัง", "ตราด", "ตาก", "นครนายก", "นครปฐม", "นครพนม", "นครราชสีมา", "นครศรีธรรมราช", "นครสวรรค์",
                "นนทบุรี", "นราธิวาส", "น่าน", "บึงกาฬ", "บุรีรัมย์", "ปทุมธานี", "ประจวบคีรีขันธ์",
                "ปราจีนบุรี", "ปัตตานี", "พระนครศรีอยุธยา", "พะเยา", "พังงา", "พัทลุง", "พิจิตร",
                "พิษณุโลก", "เพชรบุรี", "เพชรบูรณ์", "แพร่", "ภูเกต", "มหาสารคาม", "มุกดาหาร", "แม่ฮ่องสอน",
                "ยโสธร",
                "ยะลา", "ร้อยเอ็ด", "ระนอง", "ระยอง", "ราชบุรี", "ลพบุรี", "ลำปาง", "ลำพูน", "เลย", "ศรีสะเกษ",
                "สกลนคร", "สงขลา", "สตูล", "สมุทรปราการ", "สมุทรสาคร", "สระแก้ว", "สระบุรี", "สิงห์บุรี",
                "สุโขทัย", "สุพรรณบุรี", "สุราษฎร์ธานี", "สุรินทร์", "หนองคาย", "หนองบัวลำภู", "อ่างทอง",
                "อำนาจเจริญ", "อุดรธานี", "อุตรดิตถ์", "อุทัยธานี", "อุบลราชธานี", "อ่างทอง", "อำนาจเจริญ"
            ],
            "ธุรกิจการพาณิชย์และการค้า": ["กรุงเทพ", "กระบี่", "กาญจนบุรี", "กาฬสินธุ์", "กำแพงเพชร", "ขอนแก่น",
                "จันทบุรี", "ฉะเชิงเทรา", "ชลบุรี", "ชัยนาท", "ชัยภูมิ", "ชุมพร", "เชียงราย", "เชียงใหม่",
                "ตรัง", "ตราด", "ตาก", "นครนายก", "นครปฐม", "นครพนม", "นครราชสีมา", "นครศรีธรรมราช", "นครสวรรค์",
                "นนทบุรี", "นราธิวาส", "น่าน", "บึงกาฬ", "บุรีรัมย์", "ปทุมธานี", "ประจวบคีรีขันธ์",
                "ปราจีนบุรี", "ปัตตานี", "พระนครศรีอยุธยา", "พะเยา", "พังงา", "พัทลุง", "พิจิตร",
                "พิษณุโลก", "เพชรบุรี", "เพชรบูรณ์", "แพร่", "ภูเกต", "มหาสารคาม", "มุกดาหาร", "แม่ฮ่องสอน",
                "ยโสธร",
                "ยะลา", "ร้อยเอ็ด", "ระนอง", "ระยอง", "ราชบุรี", "ลพบุรี", "ลำปาง", "ลำพูน", "เลย", "ศรีสะเกษ",
                "สกลนคร", "สงขลา", "สตูล", "สมุทรปราการ", "สมุทรสาคร", "สระแก้ว", "สระบุรี", "สิงห์บุรี",
                "สุโขทัย", "สุพรรณบุรี", "สุราษฎร์ธานี", "สุรินทร์", "หนองคาย", "หนองบัวลำภู", "อ่างทอง",
                "อำนาจเจริญ", "อุดรธานี", "อุตรดิตถ์", "อุทัยธานี", "อุบลราชธานี", "อ่างทอง", "อำนาจเจริญ"
            ],
            "ธุรกิจเทคโนโลยีและสารสนเทศ": ["กรุงเทพ", "กระบี่", "กาญจนบุรี", "กาฬสินธุ์", "กำแพงเพชร", "ขอนแก่น",
                "ตรัง",
                "ตราด", "ตาก", "นครนายก", "นครปฐม", "นครพนม", "นครราชสีมา", "นครศรีธรรมราช", "นครสวรรค์",
                "นนทบุรี", "นราธิวาส", "น่าน", "บึงกาฬ", "บุรีรัมย์", "ปทุมธานี", "ประจวบคีรีขันธ์",
                "ปราจีนบุรี", "ปัตตานี", "พระนครศรีอยุธยา", "พะเยา", "พังงา", "พัทลุง", "พิจิตร", "พิษณุโลก",
                "เพชรบุรี", "เพชรบูรณ์", "แพร่", "ภูเกต", "มหาสารคาม", "มุกดาหาร", "แม่ฮ่องสอน", "ยโสธร", "ยะลา",
                "ร้อยเอ็ด", "ระนอง", "ระยอง", "ราชบุรี", "ลพบุรี", "ลำปาง", "ลำพูน", "เลย", "ศรีสะเกษ",
                "สกลนคร", "สงขลา", "สตูล", "สมุทรปราการ", "สมุทรสาคร", "สระแก้ว", "สระบุรี", "สิงห์บุรี",
                "สุโขทัย", "สุพรรณบุรี", "สุราษฎร์ธานี", "สุรินทร์", "หนองคาย", "หนองบัวลำภู", "อ่างทอง",
                "อำนาจเจริญ", "อุดรธานี", "อุตรดิตถ์", "อุทัยธานี", "อุบลราชธานี", "อ่างทอง", "อำนาจเจริญ"
            ]
            // เพิ่มประเภทงานอื่น ๆ และรายชื่อจังหวัดตามที่ต้องการ
        }


        // เพิ่มตัวเลือก "ประเภทงาน" จากข้อมูลใน subjectObject
        for (var subject in subjectObject) {
            subjectSel.options[subjectSel.options.length] = new Option(subject, subject);
        }

        // เมื่อเลือก "ประเภทงาน"
        subjectSel.onchange = function() {
            // ล้างตัวเลือก "ประเภทธุรกิจ" และ "สถานที่ทำงานหลัก"
            topicSel.length = 1;
            chapterSel.length = 1;

            // หาค่าที่เลือกใน "ประเภทงาน"
            var selectedSubject = subjectSel.value;

            // ถ้าเลือก "เลือกประเภทงาน" ให้ออกจากการทำงาน
            if (selectedSubject === "") return;

            // เพิ่มตัวเลือก "ประเภทธุรกิจ" จากข้อมูลใน subjectObject
            for (var topic of subjectObject[selectedSubject]) {
                topicSel.options[topicSel.options.length] = new Option(topic, topic);
            }
        };

        // เมื่อเลือก "ประเภทธุรกิจ"
        topicSel.onchange = function() {
            // ล้างตัวเลือก "สถานที่ทำงานหลัก"
            chapterSel.length = 1;

            // หาค่าที่เลือกใน "ประเภทงาน" และ "ประเภทธุรกิจ"
            var selectedSubject = subjectSel.value;
            var selectedTopic = topicSel.value;

            // ถ้ามีการเลือกทั้ง "ประเภทงาน" และ "ประเภทธุรกิจ"
            if (selectedSubject !== "" && selectedTopic !== "") {
                // เพิ่มตัวเลือก "สถานที่ทำงานหลัก" จากข้อมูลใน WorkObject
                var locations = WorkObject[selectedSubject];
                for (var location of locations) {
                    chapterSel.options[chapterSel.options.length] = new Option(location, location);
                }
            }
        };

        // เพิ่มตัวเลือก "สถานที่ทำงานหลัก" จากข้อมูลใน WorkObject
        var chapterSel = document.getElementById("chapter");

        // ล้างตัวเลือก "สถานที่ทำงานหลัก" ในกรณีที่มีตัวเลือกอื่น ๆ
        chapterSel.innerHTML = '<option value="" selected="selected">---เลือกสถานที่ทำงานหลัก---</option>';

        var selectedSubject = subjectSel.value; // ประเภทงานที่เลือก
        var selectedTopic = topicSel.value; // ประเภทธุรกิจที่เลือก

        if (selectedSubject && selectedTopic) {
            // ดึงข้อมูลสถานที่ทำงานหลักจาก WorkObject
            var locations = WorkObject[selectedSubject];
            if (locations && locations.length > 0) {
                // สร้างตัวเลือกสำหรับสถานที่ทำงานหลัก
                for (var i = 0; i < locations.length; i++) {
                    var location = locations[i];
                    chapterSel.innerHTML += '<option value="' + location + '">' + location + '</option>';
                }
            }
        }
    </script>
    </section>
    </form>
</body>

</html>
